data = `
{
  "CRT":{
    "Name":"CRT Portfolio",
    "Desc":[["text","A simple HTML/CSS/JS project, recreating a very basic CRT-ish look."],
            ["image","img_crt.png"]],
    "Cover":"cover_crt.png",
    "Links":{"web":"https://crt.scottishpuff.in"}
  },
  "Saturated":{
    "Name":"Saturated",
    "Desc":[["text","A simple betterdiscord style, meant to make discord easier on the eye. It increases overall saturation giving tha app a blue-ish tint. It has not been approved by the betterdiscord mod team, so it is only available via my github."],
            ["image","img_saturated.png"],
            ["text","If you have any suggestions, improvements or question, feel free to message me on discord."]],
    "Cover":"cover_saturated.png",
    "Links":{"github":"https://github.com/WeeScottishPuffin/Saturated"}
  },
  "FakeDiscordRpc":{
    "Name":"Fake Discord RPC",
    "Desc":[["text","This simple python program sets your discord 'Now playing' status to that of a custom (fake) game. Right now, it supports GTA 6 and the Elder Scrolls 6: Hammerfell. Both are unreleased games, so you can use this program to trick your friends."],
            ["text","You will need python 3 to run this program."],
            ["image","cover_DRPC.png"]],
    "Cover":"cover_DRPC.png",
    "Links":{"github":"https://github.com/WeeScottishPuffin/DRPC"}
  },
  "VibeBot":{
    "Name":"Vibe Bot",
    "Desc":[["text","A simple discord bot, which keeps track of how much users swear. It is far from perfect, and is more a proof of concept. It also served as an introduction to the discord.py library."],
            ["image","img_vibebot.png"],
            ["text","As of now, the source code is not available to download."]],
    "Cover":"cover_vibebot.png",
    "Links":[]
  },
  "SOSF":{
    "Name":"SOSF Website",
    "Desc":[["text","This was a small project I used to work on with a friend of mine. This site is unfinished and not really polished at all. A lot of images are missing and the content is no longer relevant. Anyways, the site is still available via the link below."],
            ["image","img_SOSF.png"]],
    "Cover":"cover_SOSF.png",
    "Links":{"web":"https://sosf.scottishpuff.in/"}
  },
  "OLD_Portfolio":{
    "Name":"Old Portfolio Website",
    "Desc":[["text","This was one of my first tries at making my portfolio website, but I wasn't happy with how it turned out. It is still online via github. Even though it turned out quite bad, it still was a learning experience. You can visit the site using the link below, or look at the code on my github."],
            ["image","img_old_portfolio.png"]],
    "Cover":"cover_old_portfolio.png",
    "Links":{"web":"https://old.scottishpuff.in"}
  },
  "IntEx":{
    "Name":"Orient. Internship Exercises",
    "Desc":[["text","In my second to last year of HAVO (highschool-ish?) I had to do an orientation internship. I had to make a few exercises for them, which are hosted on the website linked above, along with other small school projects."],
          ["image","img_archive.png"],
          ["text","The first exercise of (above) they asked me to make was to recreate an image they provided in html/css/js. It was quite an easy exercise. I also had to recreate a webpage (non responsive), make a simple password generator, recreate a working elevator panel (html/css/js) and finally create a simple alarm webapp. Ultimately, the exercises were a good way to reinforce my knowledge of html/css/js and were not too challenging. Sadly, the internship only lasted three days, so there wasn't a lot of time to get to the harder exerrcises."],
          ["text","I'm currently remaking some of the exercises to see how I have improved, and how I'll do without any time restrictions."]],
    "Cover":"cover_archive.png",
    "Links":{"web":"https://archives.scottishpuff.in/","github":"https://www.github.com/WeeScottishPuffin/Exercises-1"}
  },
  "VESTI":{
    "Name":"VESTI Parking CLI",
    "Desc":[["text","I made this project as a intake exercise for my MBO school. It is a simple CLI (?) to interact with a fictional set of parking garages and cars. It is written in python. The github repository is linked below."],["image","cover_vesti.png"]],
    "Cover":"cover_vesti.png",
    "Links":{"github":"https://www.github.com/WeeScottishPuffin/VESTI"}
  }
}
`;