data = `
{
  "CRT": {
    "Name": "CRT Portfolio",
    "Tags":["HTML","JS"],
    "Desc": [
      [
        "text",
        "One of my earlier html/css/js projects. I liked the look of old crt-ish displays and wanted to recreate that effect. It has some simple commands, a very rudimentary 'filesystem' and a nice boot animation. Right now, it's pretty basic (and the code is one hell of a mess), but I'm considering remaking it later on."
      ],
      [
        "image",
        "img_crt.webp"
      ]
    ],
    "Cover": "cover_crt.webp",
    "Links": {
      "web": "https://crt.scottishpuff.in"
    }
  },
  "Saturated": {
    "Name": "Saturated",
    "Tags":["Theme"],
    "Desc": [
      [
        "text",
        "A simple betterdiscord style, meant to make discord easier on the eye. It increases overall saturation giving tha app a blue-ish tint. It has not been approved by the betterdiscord mod team, so it is only available via my github. It is quite simple and not really impressive. I am however working on more themes for applications like discord and vscode to improve."
      ],
      [
        "image",
        "img_saturated.webp"
      ]
    ],
    "Cover": "cover_saturated.webp",
    "Links": {
      "github": "https://github.com/WeeScottishPuffin/Saturated"
    }
  },
  "FakeDiscordRpc": {
    "Name": "Fake Discord RPC",
    "Tags":["Python"],
    "Desc": [
      [
        "text",
        "This simple python program sets your discord 'Now playing' status to that of a custom (fake) game. Right now, it supports GTA 6 and the Elder Scrolls 6: Hammerfell. Both are unreleased games, so you can use this program to trick your friends."
      ],
      [
        "text",
        "You will need python 3 to run this program."
      ],
      [
        "image",
        "cover_DRPC.webp"
      ]
    ],
    "Cover": "cover_DRPC.webp",
    "Links": {
      "github": "https://github.com/WeeScottishPuffin/DRPC"
    }
  },
  "OLD_Portfolio": {
    "Name": "Old Portfolio Website",
    "Tags":["HTML"],
    "Desc": [
      [
        "text",
        "This was one of my first tries at making my portfolio website, but I wasn't happy with how it turned out. I experimented with a centered layout for the first time. Ultimately, I focussed too much on little details and lost sight of the bigger design. Even though it turned out quite bad, it still was a learning experience. I've decided to keep it online via github. You can visit the site using the link below, or look at the code on my github."
      ],
      [
        "image",
        "img_old_portfolio.webp"
      ]
    ],
    "Cover": "cover_old_portfolio.webp",
    "Links": {
      "web": "https://old.scottishpuff.in"
    }
  },
  "IntEx": {
    "Name": "Orient. Internship Exercises",
    "Tags":["HTML","JS"],
    "Desc": [
      [
        "text",
        "In my second to last year of HAVO (highschool-ish?) I had to do an orientation internship. I had to make a few exercises for them, which are hosted on the website linked above, along with other small school projects."
      ],
      [
        "image",
        "img_archive.webp"
      ],
      [
        "text",
        "The first exercise of (above) they asked me to make was to recreate an image they provided in html/css/js. It was quite an easy exercise. I also had to recreate a webpage (non responsive), make a simple password generator, recreate a working elevator panel (html/css/js) and finally create a simple alarm webapp. Ultimately, the exercises were a good way to reinforce my knowledge of html/css/js and were not too challenging. Sadly, the internship only lasted three days, so there wasn't a lot of time to get to the harder exerrcises."
      ],
      [
        "text",
        "I'm currently remaking some of the exercises to see how I have improved, and how I'll do without any time restrictions."
      ]
    ],
    "Cover": "cover_archive.webp",
    "Links": {
      "web": "https://archives.scottishpuff.in/",
      "github": "https://www.github.com/WeeScottishPuffin/Exercises-1"
    }
  },
  "VESTI": {
    "Name": "VESTI Parking CLI",
    "Tags":["Python"],
    "Desc": [
      [
        "text",
        "I made this project as a intake exercise for my MBO school. It is a simple CLI (?) to interact with a fictional set of parking garages and cars. It is written in python. The github repository is linked below."
      ],
      [
        "image",
        "cover_vesti.webp"
      ]
    ],
    "Cover": "cover_vesti.webp",
    "Links": {
      "github": "https://www.github.com/WeeScottishPuffin/VESTI"
    }
  },
  "Seafoam": {
    "Name": "Seafoam",
    "Tags":["Theme"],
    "Desc": [
      [
        "text",
        "My first attempt at making an theme for vscode. I based it on the 'Seafoam Pastel' terminal theme, which I found on windows terminal themes. The theme is dark and easy on the eyes. The colours are pastel-like, which gives the theme a very soft look. I recommend installing a sans-serif alongside it for an even cleaner look. Both the github and VS marketplace are linked above."
      ],
      [
        "image",
        "img_seafoam.webp"
      ],
      [
        "text",
        "Below is a bit of nonsensical example code to show syntax highlighting and some more layout."
      ],
      [
        "image",
        "img_seafoam2.webp"
      ],
      [
        "text",
        "I am still working on fixing some flaws with the theme, and I am grateful for any feedback or suggestions (You can contact me via mail or discord). I also hope to adapt this theme for betterdiscord and other applications in the future."
      ]
    ],
    "Cover": "cover_seafoam.webp",
    "Links": {
      "github": "https://www.github.com/WeeScottishPuffin/Seafoam",
      "download": "https://marketplace.visualstudio.com/items?itemName=ScottishPuffin.theme-sf"
    }
  },
  "MasterMind": {
    "Name": "Master Mind",
    "Tags":["Java"],
    "Desc": [
      [
        "text",
        "This is my first real project that I've written using Java and the first casus for my CS course. The objective was to simply recreate this elementary game, without many restrictions. This being my first experience with Java programming, the code may be a bit messy or unoptimised. However, I do still reckon that I've succeeded with programming the casus."
      ],
      [
        "image",
        "image_mind.webp"
      ]
    ],
    "Cover": "cover_mind.webp",
    "Links": {
      "github": "https://www.github.com/WeeScottishPuffin/Mastermind"
    }
  },
  "MasterMindCS": {
    "Name": "Master Mind (C#)",
    "Tags":["C#"],
    "Desc": [
      [
        "text",
        "My first project in Java, rewritten in C#. Again it is quite a simple ascii game like MasterMind. This time there is also a precompiled release available on Github."
      ],
      [
        "image",
        "image_mind.webp"
      ]
    ],
    "Cover": "cover_mind_cs.webp",
    "Links": {
      "github": "https://www.github.com/WeeScottishPuffin/Mastermind-CS"
    }
  },
  "AccessDBFiller": {
    "Name": "AccessDB Filler",
    "Tags":["Python"],
    "Desc": [
      [
        "text",
        "A simple, somewhat messy python program to generate filler data for an microsoft access database I was using for a project. You are able to input parameters and limits for the generated data, which it exports to a text file. The file can easily be imported into the database itself. I am working on automating this further using the pyodbc module to access the database and write the generated data directly."
      ],
      [
        "image",
        "img_accessdb.webp"
      ],
      [
        "text",
        "A generated dataset"
      ]
    ],
    "Cover": "cover_accessdb.webp",
    "Links": {
      "github": "https://www.github.com/WeeScottishPuffin/AccessDBFiller"
    }
  },
  "ChromaPie": {
    "Name": "ChromaPie",
    "Tags":["Python","Package"],
    "Desc": [
      [
        "text",
        "A simple python module I wrote and published to familiarise myself with PyPI and Python packaging. You can easily colour text or apply other ansi styles. It can support for 8-bit colours and 8-bit RGB colours, depending on your terminal. You can also easily view an overview of available colours"
      ],
      [
        "image",
        "img_chromapie.webp"
      ]
    ],
    "Cover": "cover_chromapie.webp",
    "Links": {
      "github": "https://www.github.com/WeeScottishPuffin/ChromaPie"
    }
  }
}
`;